<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f5431d18f21d99c0ba48ac554910aa6a16b8dc5df6476ada450c19d847235c62","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1305 at https://github.com/cal-itp/data-infra/actions/runs/20824016686","plan_out_hash":"5b7ba7fb36583351d4d475f73e231b44d17ff40e3c1ae3fe1b7c36c5b8dbcbd0","plan_hash":"2fe3d808bb194c0d5b1e5d210c6a3766bace7470a1959596f34121903caa8372","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/parse_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1305](https://github.com/cal-itp/data-infra/actions/runs/20824016686)